app/Http/Controllers/API/EventsController.php

insert into `event_notifications` (`time`, `time_tz`, `event_name`, `provider`, `source`, `filename`, `expiry`, `expiry_tz`, `updated_at`, `created_at`) values ('2018-10-30 09:56:44', '+08:00', 'some', 'provider', '', 'filename', '2018-10-30 09:56:44', '+09:00', '2018-12-17 08:13:41', '2018-12-17 08:13:41')
---
    private function logEventNotification($request){

        $notification = new EventNotification;
        $notification->time = $this->toUTCdateTime($request->_time)['date'];
        $notification->time_tz = $this->toUTCdateTime($request->_time)['timezone'];
        $notification->event_name = $request->event['name'];
        $notification->provider = $request->event['provider'] ;
        $notification->source = $request->event['source'] ? $request->event['source'] : null;
        $notification->filename = $request->parameters['filename'];
        $notification->expiry = $this->toUTCdateTime($request->parameters['expiry'])['date'];
        $notification->expiry_tz = $this->toUTCdateTime($request->parameters['expiry'])['timezone'];
        if(!$notification->save()){