app/Http/Controllers/API/UsersController.php

    public function getUserInfo(Request $request)
    {
        try {
            // get user auth_id from request
            list($tag,$auth_id) = explode("|",$request->user->sub);

            // Get the user details
            $user = User::where('auth_id',$auth_id)->first();
            if(!$user){
                return response()->json(['error' => 'User not found.'], 404);
            }

            $userLedgers = [];
            foreach ($user->ledgers as $ledger) {
                $newledger = Ledger::where('id',$ledger->ledger_id)->first();
---
select * from `users` where `auth_id` = '5c1245ae0c9db45f17e18f46' limit 1
select * from `ledgers` where `id` = '185a2200-f93c-11e8-84d0-274809133d3d' limit 1